def solution(letter):
    morse = {
        '.-': 'a', '-...': 'b', '-.-.': 'c', '-..': 'd', '.': 'e', '..-.': 'f',
        '--.': 'g', '....': 'h', '..': 'i', '.---': 'j', '-.-': 'k', '.-..': 'l',
        '--': 'm', '-.': 'n', '---': 'o', '.--.': 'p', '--.-': 'q', '.-.': 'r',
        '...': 's', '-': 't', '..-': 'u', '...-': 'v', '.--': 'w', '-..-': 'x',
        '-.--': 'y', '--..': 'z'
    }

    answer = ''
    tmp = letter.split(' ') # letter를 공백(' ')을 기준으로 나눔 -> 리스트로 전환

    for _ in tmp:
        answer += morse[_] # 인덱싱한 값을 morse 딕셔너리에서 인덱싱해서 문자로 answer에 저장

    return answer
